
//⌬──────────────────────────────────────
//┃  ༒ 𝑫𝑬𝑽𝑬𝑳𝑶𝑷𝑬𝑫 𝑩𝒀 𝑯𝑬𝑵𝑹𝒀 𝑨𝑹𝑪𝑨𝑵𝑮𝑬𝑳𝑶  ༒
//┃┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
//┃ ✞ঔৣ 𝙿𝚕𝚎𝚊𝚜𝚎 𝚌𝚛𝚎𝚍𝚒𝚝 𝚒𝚏 𝚢𝚘𝚞 𝚞𝚜𝚎 𝚝𝚑𝚎 𝚌𝚘𝚍𝚎 ঔৣ✞
//┃ 𖤍 𝘾𝙤𝙣𝙩𝙖𝙘𝙩-𝙢𝙚 𝙛𝙤𝙧 𝙖𝙣𝙮 𝙙𝙤𝙪𝙗𝙩
// ╰─...⌬─────────────────────────────────

let media = './media/menus/Menu4paypal.jpg'
let handler = async (m, { conn, command }) => {
let fkontak = { "key": { "participants":"0@s.whatsapp.net", "remoteJid": "status@broadcast", "fromMe": false, "id": "Halo" }, "message": { "contactMessage": { "vcard": `BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender.split('@')[0]}\nitem1.X-ABLabel:Ponsel\nEND:VCARD` }}, "participant": "0@s.whatsapp.net" }
let pp = "https://telegra.ph/file/641687c4087fd31c969ca.jpg"
  let user = db.data.users[m.sender]
let str = `𝑨𝒈𝒓𝒂𝒅𝒆𝒄𝒐 𝒑𝒆𝒍𝒂 𝒄𝒐𝒓𝒕𝒆𝒔𝒊𝒂 𝒅𝒆 𝒗𝒐𝒔𝒔𝒂 𝒊𝒏𝒕𝒆𝒓𝒂𝒄𝒂𝒐 𝒄𝒐𝒎 𝒎𝒊𝒏𝒉𝒂 𝒄𝒓𝒊𝒂𝒄𝒂𝒐. 𝑷𝒂𝒓𝒂 𝒑𝒆𝒓𝒑𝒆𝒕𝒖𝒂𝒓 𝒆𝒔𝒕𝒆 𝒆𝒇𝒆𝒎𝒆𝒓𝒐 𝒊𝒏𝒕𝒆𝒓𝒍𝒖𝒅𝒊𝒐 𝒏𝒐 𝒒𝒖𝒂𝒍 𝒄𝒐𝒍𝒐𝒄𝒐 𝒎𝒆𝒖 𝒆𝒎𝒑𝒆𝒏𝒉𝒐, 𝒄𝒐𝒏𝒔𝒊𝒅𝒆𝒓𝒂𝒊 𝒄𝒐𝒎𝒑𝒂𝒓𝒕𝒊𝒍𝒉𝒂𝒓 𝒎𝒆𝒖 𝒕𝒓𝒂𝒃𝒂𝒍𝒉𝒐 𝒐𝒖 𝒇𝒂𝒛𝒆𝒓 𝒖𝒎𝒂 𝒈𝒆𝒏𝒆𝒓𝒐𝒔𝒂 𝒅𝒐𝒂𝒄𝒂𝒐, 𝒄𝒐𝒎𝒐 𝒖𝒎𝒂 𝒎𝒆𝒍𝒂𝒏𝒄𝒐𝒍𝒊𝒄𝒂 𝒔𝒊𝒏𝒇𝒐𝒏𝒊𝒂 𝒆𝒄𝒐𝒂𝒏𝒅𝒐 𝒏𝒐𝒔 𝒄𝒐𝒏𝒇𝒊𝒔 𝒆𝒕𝒆𝒓𝒆𝒐𝒔. 🕯️🪦

𝑴𝒆𝒓𝒄𝒊 𝒅'𝒂𝒗𝒂𝒏𝒄𝒆 
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
𝙺𝚘-𝚏𝚒 ☕
https://ko-fi.com/henryarcangelo

ᴘᴀʏᴘᴀʟ 
https://paypal.me/henryarcangelo

ᴍᴇᴛᴀᴍᴀᴤᴋ 
*0x6628748F9E604892426126A478c279dff78d1c25*

ᴘɪx 🇧🇷
*56ba1dca-79bb-40a0-8005-caae28f7968d*

ᴵᴮᴬᴺ 🇪🇺
*PT50 0007 0000 0070 7808 9042 3*

〘𝙼𝙱way〙
*927 285 125*
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈`
await conn.sendFile(m.chat, pp, 'gata.mp4', str, fkontak)
}
/*conn.sendHydrated(m.chat, str, `𝙂𝘼𝙏𝘼 𝘿𝙄𝙊𝙎 - 𝘼𝙎𝙄𝙎𝙏𝙀𝙉𝘾𝙄𝘼\n${asistencia}\n\n` + wm, media, 'https://paypal.me/OficialGD', '🎁 𝘿𝙤𝙣𝙖𝙧 | 𝘿𝙤𝙣𝙖𝙩𝙚', null, null, [
['𝙂𝙧𝙪𝙥𝙤𝙨 𝙊𝙛𝙞𝙘𝙞𝙖𝙡𝙚𝙨 | 𝙂𝙧𝙤𝙪𝙥𝙨 🔰', '.grupos'],
['𝘾𝙧𝙚𝙖𝙙𝙤𝙧𝙖 | 𝘾𝙧𝙚𝙖𝙩𝙤𝙧 💗', '#owner'],
['𝙑𝙤𝙡𝙫𝙚𝙧 𝙖𝙡 𝙈𝙚𝙣𝙪́ | 𝘽𝙖𝙘𝙠 𝙩𝙤 𝙈𝙚𝙣𝙪 ☘️', '/menu']
], m,)}*/
handler.command = /^dona|doar|apoiar|paypal|donating$/i
handler.exp = 0
export default handler
